{"format":"graph-model","generatedBy":"2.6.2","convertedBy":"TensorFlow.js Converter v3.11.0","signature":{"inputs":{"input_1":{"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"28"},{"size":"28"},{"size":"1"}]}}},"outputs":{"dense":{"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"10286"}]}}}},"modelTopology":{"node":[{"name":"StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},{"name":"StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},{"name":"StatefulPartitionedCall/sequential/conv2d_3/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/sequential/conv2d_3/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/sequential/conv2d_4/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/sequential/conv2d_4/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/sequential/conv2d_5/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/sequential/conv2d_5/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/sequential/global_average_pooling2d/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},{"name":"StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"},{"size":"10286"}]}}}}},{"name":"StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"10286"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"input_1","op":"Placeholder","attr":{"shape":{"shape":{"dim":[{"size":"-1"},{"size":"28"},{"size":"28"},{"size":"1"}]}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Scaled","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Scaled","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Scaled","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/conv2d/Relu","op":"_FusedConv2D","input":["input_1","StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp","StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Mul","op":"Mul","input":["StatefulPartitionedCall/sequential/conv2d/Relu","StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3","op":"Add","input":["StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Mul","StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/conv2d_1/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3","StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp","StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"num_args":{"i":"1"},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Mul","op":"Mul","input":["StatefulPartitionedCall/sequential/conv2d_1/Relu","StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3","op":"Add","input":["StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Mul","StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/conv2d_2/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3","StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp","StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","2","2","1"]}},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"epsilon":{"f":0},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Mul","op":"Mul","input":["StatefulPartitionedCall/sequential/conv2d_2/Relu","StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3","op":"Add","input":["StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Mul","StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/conv2d_3/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3","StatefulPartitionedCall/sequential/conv2d_3/Conv2D/ReadVariableOp","StatefulPartitionedCall/sequential/conv2d_3/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"padding":{"s":"VkFMSUQ="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Mul","op":"Mul","input":["StatefulPartitionedCall/sequential/conv2d_3/Relu","StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Scaled"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3","op":"Add","input":["StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Mul","StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Offset"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/conv2d_4/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3","StatefulPartitionedCall/sequential/conv2d_4/Conv2D/ReadVariableOp","StatefulPartitionedCall/sequential/conv2d_4/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"epsilon":{"f":0},"padding":{"s":"VkFMSUQ="}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Mul","op":"Mul","input":["StatefulPartitionedCall/sequential/conv2d_4/Relu","StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Scaled"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3","op":"Add","input":["StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Mul","StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Offset"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/conv2d_5/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3","StatefulPartitionedCall/sequential/conv2d_5/Conv2D/ReadVariableOp","StatefulPartitionedCall/sequential/conv2d_5/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Mul","op":"Mul","input":["StatefulPartitionedCall/sequential/conv2d_5/Relu","StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Scaled"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3","op":"Add","input":["StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Mul","StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Offset"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/global_average_pooling2d/Mean","op":"Mean","input":["StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3","StatefulPartitionedCall/sequential/global_average_pooling2d/Mean/reduction_indices"],"attr":{"Tidx":{"type":"DT_INT32"},"keep_dims":{"b":false},"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/sequential/dense/BiasAdd","op":"_FusedMatMul","input":["StatefulPartitionedCall/sequential/global_average_pooling2d/Mean","StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp","StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"transpose_a":{"b":false},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"transpose_b":{"b":false},"num_args":{"i":"1"},"epsilon":{"f":0}}},{"name":"StatefulPartitionedCall/sequential/dense/Softmax","op":"Softmax","input":["StatefulPartitionedCall/sequential/dense/BiasAdd"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"Identity","op":"Identity","input":["StatefulPartitionedCall/sequential/dense/Softmax"],"attr":{"T":{"type":"DT_FLOAT"}}}],"library":{},"versions":{"producer":808}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp","shape":[3,3,1,32],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp","shape":[32],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp","shape":[3,3,32,32],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp","shape":[32],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp","shape":[3,3,32,32],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp","shape":[32],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/conv2d_3/Conv2D/ReadVariableOp","shape":[3,3,32,64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/conv2d_3/BiasAdd/ReadVariableOp","shape":[64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/conv2d_4/Conv2D/ReadVariableOp","shape":[3,3,64,64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/conv2d_4/BiasAdd/ReadVariableOp","shape":[64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/conv2d_5/Conv2D/ReadVariableOp","shape":[3,3,64,64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/conv2d_5/BiasAdd/ReadVariableOp","shape":[64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/global_average_pooling2d/Mean/reduction_indices","shape":[2],"dtype":"int32"},{"name":"StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp","shape":[64,10286],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp","shape":[10286],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled","shape":[32],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset","shape":[32],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled","shape":[32],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset","shape":[32],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Scaled","shape":[64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization_5/FusedBatchNormV3/Offset","shape":[64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Scaled","shape":[64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization_4/FusedBatchNormV3/Offset","shape":[64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Scaled","shape":[64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization_3/FusedBatchNormV3/Offset","shape":[64],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled","shape":[32],"dtype":"float32"},{"name":"StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset","shape":[32],"dtype":"float32"}]}]}